<?PHP
/****************************************************
 * Copyright © 2017
=====================================================
 * Файл: index.php
-----------------------------------------------------
 * Назначение: Запуск инициализации
=====================================================
****************************************************/

    use Main\MySQL\InitDB as DB;

//Вывод ошибок
	$php_errors = FALSE;

	require './engine/starter_module.php';

//Подключение БД
    require CLASSES . '/main/mysql/default.php';

	$db = new DB;

//Подключаем API
	include ENGINE . '/api.php';